#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repos.github_repository.repository_branch_autoinit["MS-Tes11"] has changed
  ~ resource "github_repository" "repository_branch_autoinit" {
      ~ etag                        = "W/\"2f8a1b65fc9a816964d21cd9f864022e22f817e9be74d4e9a11434833d0157ec\"" -> "W/\"bcb6e0e5c9a80c344fbecd67860a78916f5e46544e0de3cb3c700ebeea9bff18\""
        id                          = "MS-Tes11"
        name                        = "MS-Tes11"
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos.github_repository.repository_branch_autoinit["MS-Test10"] has changed
  ~ resource "github_repository" "repository_branch_autoinit" {
      ~ etag                        = "W/\"b00fcc16db4cf68fcc48f3dd8b85f53a1096f427bdae4d629c41f5a5852056c5\"" -> "W/\"f6a782417492fd0d02161ccc8788f6e0118b56dc27d247da1d7b63795929acbe\""
        id                          = "MS-Test10"
        name                        = "MS-Test10"
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.repos.github_branch_default.default["MS-Test12"] will be created
  + resource "github_branch_default" "default" {
      + branch     = "master"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = true
      + repository = "MS-Test12"
    }

  # module.repos.github_branch_protection.branch_policy["MS-Test12"] will be created
  + resource "github_branch_protection" "branch_policy" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "master"
      + repository_id                   = "MS-Test12"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 2
          + restrict_dismissals             = false
        }
    }

  # module.repos.github_repository.repository_branch_autoinit["MS-Test12"] will be created
  + resource "github_repository" "repository_branch_autoinit" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Repository managed by Terraform"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "MS-Test12"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }
    }

  # module.repos.github_repository_file.pipeline_file["MS-Test12"] will be created
  + resource "github_repository_file" "pipeline_file" {
      + branch              = "refs/heads/master"
      + commit_message      = "Añade o actualiza pipelines_file via terraform ***NO_CI***"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: 001-ms-template-caller
            
            on:
              push:
                branches: none # [ main ]
              pull_request:
                branches: none # [ main ]
            
              # Allows you to run this workflow manually from the Actions tab
              workflow_dispatch:
            
            jobs:
              call-pipeline-workflow-A:
                uses: josue-r/Pipelines/.github/workflows/github-pipelines.yml@main
                with:
                  username: Josue
                  lastname: Ruiz
                secrets:
                  token: ${{ secrets.TOKEN }}
            
              call-pipeline-workflow-B:
                uses: josue-r/Pipelines/.github/workflows/github-pipelines.yml@main
                with:
                  username: Vero
                  lastname: Zamora
                secrets:
                  token: ${{ secrets.TOKEN }}
        EOT
      + file                = ".github/workflows/github-pipelines.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "MS-Test12"
      + sha                 = (known after apply)
    }

  # module.repos.github_repository_file.pr_template["MS-Test12"] will be created
  + resource "github_repository_file" "pr_template" {
      + branch              = "refs/heads/master"
      + commit_message      = "Añade o actualiza pr_template via terraform ***NO_CI***"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## What does this PR do?
            
            [comment]: <> (A brief explanation synthesizing the feature, bug or, fix.)
            
            - this
            - that
            
            ## Where should the reviewer start?
            
            [comment]: <> (Explain where the reviewer should start to review the whole addition or subtractions.)
            :checkered_flag:
            
            ## How should this be manually tested?
            
            [comment]: <> (List of steps to reproduce, corroborate, or tests to run. Write this section enough so that external users can also follow it and test the fix.)
            
            1. :one:
            2. :two:
            3. :tada:
            
            ## Any background context you want to provide?
            
            [comment]: <> (Any information regarding the PR that the reviewer should know.)
            :construction:
            
            ## What are the relevant tickets?
            
            [comment]: <> (Link to issues, related PR, JIRA issues, etc.)
            Closes [JIRA/Monday/{TICKET_ID}]()
            
            ## Screenshots
            
            [comment]: <> (Screenshots of the feature if available.)
            :camera:
            
            ## Questions
            
            [comment]: <> (If available, to another developer or reviewer.)
            :question:
        EOT
      + file                = ".github/pull_request_template.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "MS-Test12"
      + sha                 = (known after apply)
    }

  # module.vpc.aws_internet_gateway.jrs_igw has moved to module.vpc.aws_internet_gateway.jrs_igw[0]
    resource "aws_internet_gateway" "jrs_igw" {
        id       = "igw-08b38bf1c07f00817"
        tags     = {
            "Name"       = "jrs VPC Internet Gateway"
            "Priviosing" = "Terraform"
        }
        # (4 unchanged attributes hidden)
    }

  # module.vpc.aws_route.jrs_public_route has moved to module.vpc.aws_route.jrs_public_route[0]
    resource "aws_route" "jrs_public_route" {
        id                     = "r-rtb-0f0ac68706be48e641080289494"
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.jrs_public_route_table has moved to module.vpc.aws_route_table.jrs_public_route_table[0]
    resource "aws_route_table" "jrs_public_route_table" {
        id               = "rtb-0f0ac68706be48e64"
        tags             = {
            "Name"       = "jrs route table for Public Subnet"
            "Priviosing" = "Terraform"
        }
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_vpc.jrs_vpc has moved to module.vpc.aws_vpc.jrs_vpc[0]
    resource "aws_vpc" "jrs_vpc" {
        id                                   = "vpc-0ab59bc30f70588ee"
        tags                                 = {
            "Name"       = "jrs VPC"
            "Priviosing" = "Terraform"
        }
        # (17 unchanged attributes hidden)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ repo_full_name = {
      + MS-Test12 = (known after apply)
        # (2 unchanged elements hidden)
    }

```

</details>


*Pusher: @josue-r, Action: `pull_request`, Working Directory: `/actions-runner/_work/terraform-jrs-local/terraform-jrs-local`, Workflow: `Create terraform plan`*